import java.util.Scanner;

public class View {

	public static void main(String[] args) {

		// View 역할 수행 : 사용자 인터페이스 (화면, 선택할 수 있게 하는 기능)

		// 재생, 정지, 다음곡, 이전곡, 종료

		Scanner sc = new Scanner(System.in);

		// Controller의 기능에 접근할 수 있도록 객체 생성
		Controller c = new Controller();

		int menu; // 사용자가 선택한 메뉴
		
		System.out.println();
		System.out.println(
				"888o.          8 8 8888          `8.`888b               ,8'             8 8888 8 8888                 .888.         888o.          8  .`8888:' `88.           8 8888    `88. 8 8888                 .888.          `8.`8888.    ,8'  8 8888         8 8888    `88   ");
		System.out.println(
				"Y88888o.       8 8 8888           `8.`888b             ,8'              8 8888 8 8888                :88888.        Y88888o.       8  8.`8888.   Y8           8 8888     `88 8 8888                :88888.          `8.`8888.  ,8'   8 8888         8 8888     `88  ");
		System.out.println(
				".`Y888888o.    8 8 8888            `8.`888b     .b    ,8'               8 8888 8 8888               . `88888.       .`Y888888o.    8  `8.`8888.               8 8888     ,88 8 8888               . `88888.          `8.`8888.,8'    8 8888         8 8888     ,88  ");
		System.out.println(
				"8o. `Y888888o. 8 8 888888888888     `8.`888b    88b  ,8'                8 8888 8 888888888888      .8. `88888.      8o. `Y888888o. 8   `8.`8888.              8 8888.   ,88' 8 8888              .8. `88888.          `8.`88888'     8 888888888888 8 8888.   ,88'  ");
		System.out.println(
				"8`Y8o. `Y88888o8 8 8888              `8.`888b .`888b,8'                 8 8888 8 8888             .8`8. `88888.     8`Y8o. `Y88888o8    `8.`8888.             8 888888888P'  8 8888             .8`8. `88888.          `8. 8888      8 8888         8 888888888P'   ");
		System.out.println(
				"8   `Y8o. `Y8888 8 8888               `8.`888b8.`8888'       88.        8 8888 8 8888            .8' `8. `88888.    8   `Y8o. `Y8888     `8.`8888.            8 8888         8 8888            .8' `8. `88888.          `8 8888      8 8888         8 8888`8b       ");
		System.out.println(
				"8      `Y8o. `Y8 8 8888                `8.`888`8.`88'        `88.       8 888' 8 8888           .8'   `8. `88888.   8      `Y8o. `Y8 8b   `8.`8888.           8 8888         8 8888           .8'   `8. `88888.          8 8888      8 8888         8 8888 `8b.     ");
		System.out.println(
				"8         `Y8o.` 8 8888                 `8.`8' `8,`'           `88o.    8 88'  8 8888          .888888888. `88888.  8         `Y8o.` `8b.  ;8.`8888           8 8888         8 8888          .888888888. `88888.         8 8888      8 8888         8 8888   `8b.   ");
		System.out.println(
				"8            `Yo 8 888888888888          `8.`   `8'              `Y888888 '    8 888888888888 .8'       `8. `88888. 8            `Yo  `Y8888P ,88P'           8 8888         8 888888888888 .8'       `8. `88888.        8 8888      8 888888888888 8 8888     `88. ");
		System.out.println();

		while (true) {
			System.out.print("[1]재생 [2]정지 [3]다음곡 [4]이전곡 [5]종료 >> ");
			menu = sc.nextInt();

			if (menu == 1) {
				c.play();
			} else if (menu == 2) {
				c.stop();
			} else if (menu == 3) {
				c.next();
			} else if (menu == 4) {
				c.prev();
			} else {
				c.stop();
				break;
			}
		}

	}

}
